notifi-it/WFH/firmware/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-AMOLED-1.8 — ESP32-S3R8, 16MB flash, 8MB octal PSRAM
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# QEMU has no PSRAM model — boot anyway instead of aborting (real board unaffected).
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# LittleFS mount recurses through lfs_dir_fetchmatch and needs far more than
# the 3584-byte default. Overflowing it corrupts whatever sits after the
# stack, which surfaces as an unrelated assert inside the flash mutex.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# The storage spike writes thousands of rows in one go; keep the watchdog
# from calling a long synchronous=FULL run a hang.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_LV_USE_PERF_MONITOR=y

# The QSPI panel is fed by DMA, and the framebuffer is cache-backed. Waveshare
# set this in every one of their examples and the S1 spike inherited it; the
# app project did not, and the screen rendered as smeared vertical bars — the
# washes stretched across the panel — while every log line still said the
# display was up. Framebuffer corruption reports nothing.
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_LV_USE_SNAPSHOT=y

# The BSP's default draw buffer is one 100-row strip, and LVGL composes the
# screen in pieces through it. That is fine for a demo; this UI draws six
# tiles with washes, dot rows and a 30fps waterline, and the strips arrived
# on the panel torn — a corrupted band through the middle that looked for
# all the world like a driver fault. A full-screen buffer removes the
# strips entirely. 368*448*2 = 330KB, which is nothing against 8MB of PSRAM.
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH=y
CONFIG_WFH_DUMP_FRAMEBUFFER=y
